tests/Mocks/Event/payment.json

{
  "recipient": {
    "id": "PAGE_ID"
  },
  "timestamp": 1473208792799,
  "sender": {
    "id": "USER_ID"
  },
  "payment": {
    "payload": "DEVELOPER_DEFINED_PAYLOAD",
    "requested_user_info": {
      "shipping_address": {
        "street_1": "1 Hacker Way",
        "street_2": "",
        "city": "MENLO PARK",
        "state": "CA",
        "country": "US",
        "postal_code": "94025"
      },
      "contact_name": "Peter Chang",
      "contact_email": "peter@anemailprovider.com",
      "contact_phone": "+15105551234"
    },
    "payment_credential": {
      "provider_type": "token",
      "charge_id": "ch_18tmdBEoNIH3FPJHa60ep123",
      "tokenized_card": "__tokenized_card__",
      "tokenized_cvv": "tokenized cvv",
      "token_expiry_month": "3",
      "token_expiry_year": "2019",
      "fb_payment_id": "123456789"
    },
    "amount": {
      "currency": "USD",
      "amount": "29.62"
    },
    "shipping_option_id": "123"
  }
}
